app/views/boards/index.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."board_id" = 1
---
		<td><%= board.name %></td>
		<td><%= board.posts.size %></td>