app/controllers/boards_controller.rb

	def index
		@boards = Board.all
		respond_to do |format|
			format.html
			format.json { render :json => @boards.map(&:attributes) }
			format.xml { render :xml => @boards.to_xml }
      format.csv do
        csv_string = CSV.generate do |csv|
            csv << ["Name", "Created At", "Posts"]
            @boards.each do |board|
                csv << [board.name, board.created_at, board.posts.size]
---
SELECT "boards".* FROM "boards"
SELECT COUNT(*) FROM "posts" WHERE "posts"."board_id" = 1

	def show
		@board = Board.find(params[:id])
		@posts = @board.posts.all
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."board_id" = 1